Revit 2026 API

# FamilyStructuralFamilyNameKey Property

---

The family's structural section shape name key.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string StructuralFamilyNameKey { get; set; }
```
```vb
Public Property StructuralFamilyNameKey As String
	Get
	Set
```
```cpp
public:
property String^ StructuralFamilyNameKey {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member StructuralFamilyNameKey : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Family Class

Autodesk.Revit.DB Namespace